package net.zzw.javase.foundational.operator.bit;

/**
 * 按位或的使用
 *
 * @author zzw dgzzw1@163.com
 * @version 2021/12/12 下午3:02
 * @since JDK11
 */
public class BitOrOperator {
	public static void main(String[] args) {
		// 按位或(|)：|左右两边的二进制补码有一个为1，运算结果为1，否则为0

		/*
			计算过程
			128 默认是四个字节的内存，在内存中的二进制补码表示为	0000 0000 0000 0000 0000 0000 1000 0000
			64	默认是四个字节的内存，在内存中的二进制补码表示为 0000 0000 0000 0000 0000 0000 0100 0000
			0000 0000 0000 0000 0000 0000 1000 0000
		  |	0000 0000 0000 0000 0000 0000 0100 0000
		  = 0000 0000 0000 0000 0000 0000 1100 0000 转换成十进制原码是输出是:192
		 */
		System.out.println("128 | 64 = " + (128 | 64));

	}
}
